def area(a):
    '''
    Возвращает площадь квадрата.

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        float: площадь квадрата (a²)

    Пример вызова:
        area(5)  # 25
    '''
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.

    Параметры:
        a (float): длина стороны квадрата

    Возвращаемое значение:
        float: периметр квадрата (4 * a)

    Пример вызова:
        perimeter(5)  # 20
    '''
    return 4 * a